<template>
  <div>
    <div class="hero-unit">
      <h2 class="text-center">Описание задачи</h2>
      <pre>
1. Создайте веб страницу, которая будет выводить древовидную структуру отделов со списком сотрудников

Информация о каждом сотруднике должна храниться в базе данных  и
содержать следующие данные
ФИО;
Должность;
Дата приема на работу;
Размер заработной платы;
Подразделение - подразделения имеют структуру до 5 уровней;

Дерево должно отображаться в свернутом виде.

База данных должна содержать не менее 50 000 сотрудников и 25 подразделений в 5 уровнях иерархий

Управление записями CRUD через административную часть Django

Django 3+, Python 3.5+, база на свое усмотрение
Используйте Twitter Bootstrap для создания базовых стилей Вашей страницы.

Если используете дополнительные библиотеки, то необходимо оформить все в requirements.txt

Готовое задание, необходимо разместить Github/Bitbucket

2. Вышлите примеры готового кода

</pre
      >
    </div>
  </div>
</template>

<script>
export default {
  name: "AboutView",
};
</script>

<style scoped>
.text-center {
  text-align: center;
}
</style>
